Revit 2016 API
Face.MaterialElementId Property
Element ID of the material from which this face is composed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public ElementId MaterialElementId { get; }
Visual Basic
Public ReadOnly Property MaterialElementId As ElementId
	Get
Visual C++
public:
property ElementId^ MaterialElementId {
	ElementId^ get ();
}
See Also
Face Class
Autodesk.Revit.DB Namespace